Revit 2027 API
ParameterTypeId.ConnectorJointType Property
 "Connector Joint Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConnectorJointType { get; }
Public Shared ReadOnly Property ConnectorJointType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConnectorJointType {
	ForgeTypeId^ get ();
}
static member ConnectorJointType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace